reading-notes/why-the-best-give-away.org
#+TITLE: 为什么最好的公司和开发者都乐于分享
#+OPTIONS: toc:nil
#+SETUPFILE: ../setup/theme-readtheorg-local.setup

本文是 [[http://blog.ycombinator.com/why-the-best-give-away/][Why the Best Companies and Developers Give Away Almost Everything They Do]] 的阅读笔记。

* 分享的形式和内容
分享主要包括把公司内部项目开源，写技术博客，在各种大会上分享公司的项目，自己的经验等。除了涉及到商业机密和公司核心技术外的内容，都可以用来分享（要经过公司同意）。分享看似利他，实则利己。

* 分享如何利己
** Mastery
学习的最好方式是传授。如果自己对某项东西都没有深刻的理解，要想给别人解释清楚，几乎是不可能的。衡量工程师是否 *高级* ，可以看他是否提高了周围人的水平。

** 质量
因为不想被人评价很垃圾，开源可以提高项目质量，使代码更整洁，测试更丰富，文档更完善。此外，如果他人使用了开源的代码，这些人会反馈bug，提出问题，这些反馈也会帮助改进质量。
事实上，项目一开始就应该按照开源的标准做。

** 招聘
分享其实是宣传公司和个人，对公司招聘和个人应聘都有好处。

* 没时间分享
没时间是因为不重要。核心还是认为 *分享* 不重要。
