blogs/why-the-best-give-away.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-13 一 12:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>为什么最好的公司和开发者都乐于分享</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">为什么最好的公司和开发者都乐于分享</h1>
<p>
本文是 <a href="http://blog.ycombinator.com/why-the-best-give-away/">Why the Best Companies and Developers Give Away Almost Everything They Do</a> 的阅读笔记。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 分享的形式和内容</h2>
<div class="outline-text-2" id="text-1">
<p>
分享主要包括把公司内部项目开源，写技术博客，在各种大会上分享公司的项目，自己的经验等。除了涉及到商业机密和公司核心技术外的内容，都可以用来分享（要经过公司同意）。分享看似利他，实则利己。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> 分享如何利己</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Mastery</h3>
<div class="outline-text-3" id="text-2-1">
<p>
学习的最好方式是传授。如果自己对某项东西都没有深刻的理解，要想给别人解释清楚，几乎是不可能的。衡量工程师是否 <b>高级</b> ，可以看他是否提高了周围人的水平。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> 质量</h3>
<div class="outline-text-3" id="text-2-2">
<p>
因为不想被人评价很垃圾，开源可以提高项目质量，使代码更整洁，测试更丰富，文档更完善。此外，如果他人使用了开源的代码，这些人会反馈bug，提出问题，这些反馈也会帮助改进质量。
事实上，项目一开始就应该按照开源的标准做。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> 招聘</h3>
<div class="outline-text-3" id="text-2-3">
<p>
分享其实是宣传公司和个人，对公司招聘和个人应聘都有好处。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> 没时间分享</h2>
<div class="outline-text-2" id="text-3">
<p>
没时间是因为不重要。核心还是认为 <b>分享</b> 不重要。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-11-13 一 12:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
